In [1]:
import pandas as pd
import numpy as np
import sqlalchemy
import pymysql

In [2]:
engine = sqlalchemy.create_engine('mysql+pymysql://root:root@localhost/testdb')

In [29]:
df = pd.read_csv(r"C:\Users\Chad\Downloads\Puppies Table v5.csv")
df

   id      name   color      breed
0   0      Reek    grey    greyjoy
1   1   greenie    grey    terrier
2   2     flash    grey  greyhound
3   3    hunter   brown    spaniel
4   4   beverly   brown  chihuahua
5   5      Buck   brown   labrador
6   6  Garfield  orange      husky
7   7      Bull   white    bulldog
8   8    Sandor   white  wolfhound
9   9  Mountain   white    maltese

In [30]:
df.rename(columns ={ #confirming that the table names are the same
    'id':'id',
    'name':'name',
    'color':'color',
    'breed':'breed'
}, inplace = True)
df

   id      name   color      breed
0   0      Reek    grey    greyjoy
1   1   greenie    grey    terrier
2   2     flash    grey  greyhound
3   3    hunter   brown    spaniel
4   4   beverly   brown  chihuahua
5   5      Buck   brown   labrador
6   6  Garfield  orange      husky
7   7      Bull   white    bulldog
8   8    Sandor   white  wolfhound
9   9  Mountain   white    maltese

In [31]:
df.to_sql(#loads puppies data to mysql
name = 'puppies',
con = engine,
index = False,
if_exists = 'append')

In [32]:
df2 = pd.read_csv(r"C:\Users\Chad\Downloads\owners table v3.csv") # owners table

In [33]:
df2.rename(columns ={ #confirming that the table names are the same and avoid spelling mistakes
    'id':'id',
    'name':'name',
    'puppy_id':'puppy_id'
    }, inplace = True)
df2

   id         name  puppy_id
0   0       Bolton         0
1   1       Samuel         1
2   2        Carly         2
3   3  Christopher         3
4   4         Bill         4
5   5         Jake         5
6   6        Chuck         6
7   7          Ben         7
8   8      Joffrey         8
9   9       Cersei         9

In [35]:
df2.to_sql(#loads owners data to mysql
name = 'owners',
con = engine,
index = False,
if_exists = 'replace')

In [36]:
df.describe()#record count

             id
count  10.00000
mean    4.50000
std     3.02765
min     0.00000
25%     2.25000
50%     4.50000
75%     6.75000
max     9.00000

In [37]:
df2.describe()#record count

             id  puppy_id
count  10.00000  10.00000
mean    4.50000   4.50000
std     3.02765   3.02765
min     0.00000   0.00000
25%     2.25000   2.25000
50%     4.50000   4.50000
75%     6.75000   6.75000
max     9.00000   9.00000

In [38]:
print(len(df.columns))# puppies column number

4

In [39]:
print(len(df2.columns))# owners column number

3

In [79]:
df.groupby(['color']).size()# breakdown of puppies by color

color
brown     3
grey      3
orange    1
white     3
dtype: int64

In [81]:
df2.count()# counts number of owners,ids, and puppies

id          10
name        10
puppy_id    10
dtype: int64

In [82]:
print(df)

   id      name   color      breed
0   0      Reek    grey    greyjoy
1   1   greenie    grey    terrier
2   2     flash    grey  greyhound
3   3    hunter   brown    spaniel
4   4   beverly   brown  chihuahua
5   5      Buck   brown   labrador
6   6  Garfield  orange      husky
7   7      Bull   white    bulldog
8   8    Sandor   white  wolfhound
9   9  Mountain   white    maltese

In [51]:
df.memory_usage() #memory usage breakdown by bytes

Index    128
id        80
name      80
color     80
breed     80
dtype: int64

In [52]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   id      10 non-null     int64
 1   name    10 non-null     object
 2   color   10 non-null     object
 3   breed   10 non-null     object
dtypes: int64(1), object(3)
memory usage: 448.0+ bytes

In [54]:
df.drop_duplicates() #drops any duplicate rows

   id      name   color      breed
0   0      Reek    grey    greyjoy
1   1   greenie    grey    terrier
2   2     flash    grey  greyhound
3   3    hunter   brown    spaniel
4   4   beverly   brown  chihuahua
5   5      Buck   brown   labrador
6   6  Garfield  orange      husky
7   7      Bull   white    bulldog
8   8    Sandor   white  wolfhound
9   9  Mountain   white    maltese